#!/usr/bin/env python
# coding: UTF-8

#####################################################################################################################
#このノードは．WS内環境認識サブシステムのテストパターンを作成したモジュールです．　　　　　　　　　　　　　　　 #
#===================================================================================================================#
#バージョン管理
#===================================================================================================================#
#ver. 0.1:  基本実装（Linux版）　　　2023/09/28
#===================================================================================================================#
#依存ノード
#===================================================================================================================#
#このノードはLinuxでのみ利用可能です．
#===================================================================================================================#

#pythonライブラリを使用

import rospy
from rospy.topics import Publisher, Subscriber

from std_msgs.msg import *
from geometry_msgs.msg import *
def callback(data):
    rospy.loginfo("I heard %s",data.data)
    
def listener():
    rospy.init_node('listener', anonymous=True)

    rospy.Subscriber("recg_data", Float32, callback)


    rospy.spin()
        
if __name__ == '__main__':
    listener()